app/controllers/api/channels_controller.rb

SELECT "channels".* FROM "channels" WHERE "channels"."workspace_id" = $1  [["workspace_id", 0]]
---
  def index
    @channels = Channel.where(workspace_id: params[:workspace_id])

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @channel = Channel.find_by_id(params[:id])

INSERT INTO "channels" ("name", "workspace_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["workspace_id", 1], ["created_at", "2019-11-07 19:17:55.822176"], ["updated_at", "2019-11-07 19:17:55.822176"]]
---
  def create
    @channel = Channel.new(channel_params)
    old_channel = Channel.find_by(channel_params)
    if old_channel
      render json: ["Channel name already exists"], status: 401
    elsif @channel.save

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "channels" WHERE "channels"."id" = $1  [["id", 4]]
---
  def destroy
    @channel = Channel.find_by_id(params[:id])
    if @channel
      @channel.destroy