app/controllers/api/sessions_controller.rb

SELECT  "workspaces".* FROM "workspaces" WHERE "workspaces"."address" = $1 LIMIT $2  [["address", "app-academy"], ["LIMIT", 1]]
SELECT  "workspace_users".* FROM "workspace_users" WHERE "workspace_users"."user_id" = $1 AND "workspace_users"."workspace_id" = $2 LIMIT $3  [["user_id", 1], ["workspace_id", 1], ["LIMIT", 1]]
---
  def create
    @user = User.find_by_credentials(
      params[:user][:email],
      params[:user][:password]
    )
    workspace = Workspace.find_by_address(params[:user][:workspace_address])
    if !workspace
      render json: ["Workspace doesn't exist"], status: 401
    elsif !@user
      render json: ["Email/Password combination doesn't exist on this workspace"], status: 401
    else
      login!(@user)
      connection = WorkspaceUser.find_by(user_id: @user.id, workspace_id: workspace.id)