app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bob"], ["LIMIT", 1]]
---
  def create
    @user = User.includes(:workspaces: [:connections]).find_by(email: user_params[:email])