app/controllers/api/users_controller.rb

SELECT  "workspaces".* FROM "workspaces" WHERE "workspaces"."address" = $1 LIMIT $2  [["address", "app-academy"], ["LIMIT", 1]]
SELECT "workspace_users".* FROM "workspace_users" WHERE "workspace_users"."user_id" = $1  [["user_id", 5]]
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "3OFEPWT2iup5u31G3TbLsA"], ["updated_at", "2019-11-05 01:18:28.808309"], ["id", 3]]
INSERT INTO "workspace_users" ("user_id", "workspace_id", "logged_in", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["workspace_id", 1], ["logged_in", true], ["created_at", "2019-11-05 01:20:45.607926"], ["updated_at", "2019-11-05 01:20:45.607926"]]
---
  def create
    # find the user and the workspace
    @user = User.find_by_credentials(
      user_params[:email],
      user_params[:password]
    )
    workspace = Workspace.find_by_address(user_params[:workspace_address])

    # 3 cases:
    #   a) workspace doesn't exist             => render errors
    #   b) workspace and user both exist       => establish a connection
    #                                                 if it works, login the user and render show
    #                                                 if not     , render errors
    #   c) workspace exists but user doesn't   => make a new user
    #                                                 if it works, login the user and establish connection
    #                                                 if not     , render errors
    if !workspace
      render json: ["Workspace doesn't exist"], status: 401
    elsif @user
      connection = WorkspaceUser.find_by(user_id: @user.id, workspace_id: workspace.id);
      if connection
        render json: ["User already exists"], status: 401
      else
        connection = WorkspaceUser.new(user_id: @user.id, workspace_id: workspace.id, logged_in: true)
        if connection.save

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "workspace_users" ("user_id", "workspace_id", "logged_in", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 6], ["workspace_id", 1], ["logged_in", true], ["created_at", "2019-11-05 04:55:16.990177"], ["updated_at", "2019-11-05 04:55:16.990177"]]
---
        email: user_params[:email],
        password: user_params[:password]
      )
      if @user.save
        WorkspaceUser.create(user_id: @user.id, workspace_id: workspace.id, logged_in: true)