app/controllers/api/workspaces_controller.rb

  def show
    @workspace = Workspace
      .includes(:users, channels: [:users, :dm_user_1, :dm_user_2]) # for channel partial later
      .find_by_address(params[:id])
    if @workspace
      if logged_in?
        @current_user = User.includes(:dm_channel_connections_1, :dm_channel_connections_2, :channel_connections).find(current_user.id) # for channel id parsing
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @workspace = Workspace.new(workspace_params)
    if !logged_in?
      render json: ["I don't know how you did this but this is illegal"], status: 402
    elsif @workspace.save
      connection = WorkspaceUser.create(user_id: current_user.id, workspace_id: @workspace.id, logged_in: true)

      general_channel = Channel.create({name: "general", workspace_id: @workspace.id})
---
INSERT INTO "workspaces" ("address", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["address", "test"], ["created_at", "2019-11-08 21:20:27.234954"], ["updated_at", "2019-11-08 21:20:27.234954"]]
INSERT INTO "workspace_users" ("user_id", "workspace_id", "logged_in", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["workspace_id", 14], ["logged_in", true], ["created_at", "2019-11-08 22:57:44.883750"], ["updated_at", "2019-11-08 22:57:44.883750"]]
INSERT INTO "channels" ("name", "workspace_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "awfsea"], ["workspace_id", 14], ["created_at", "2019-11-08 22:57:44.873833"], ["updated_at", "2019-11-08 22:57:44.873833"]]