app/controllers/api/workspaces_controller.rb

  def show
    @workspace = Workspace.find_by_address(params[:id])
---
SELECT  "workspaces".* FROM "workspaces" WHERE "workspaces"."address" = $1 LIMIT $2  [["address", "app-academy"], ["LIMIT", 1]]