app/controllers/api/workspaces_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # include channels:[:users] for channels partial (dm_user_1 and dm_user_2 isn't necessary because they would need 2 either way)
    # include users and connections also for convenience
    @workspace = Workspace
      .includes(:connections, :users, channels: [:users, :dm_channel_connection])
      .find_by_address(params[:id])
    if @workspace
      if logged_in?
        # will need all four values later, just load them here for convenience
        @current_user = User.includes(
          :dm_channel_connections_1,
          :dm_channel_connections_2,
          :channel_connections,
          :message_saves).find(current_user.id) # for channel id parsing