app/views/api/channels/_channel.json.jbuilder

INSERT INTO "channels" ("name", "workspace_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["workspace_id", 1], ["created_at", "2019-11-07 19:17:55.822176"], ["updated_at", "2019-11-07 19:17:55.822176"]]
---
json.dm_channel channel.dm_channel
json.created_at channel.created_at