app/views/api/workspaces/show.json.jbuilder

SELECT "channels".* FROM "channels" WHERE "channels"."workspace_id" = $1  [["workspace_id", 1]]
---
  # Pull out all user channel information - channels, dm_channels, and active_dm_channels
  user_channel_ids = @current_user.channel_connections.map { |connection| connection.channel_id }