app/controllers/application_controller.rb

  def current_workspace
    return nil unless session[:session_token]
    connection = WorkspaceUser.find_by(user_id: current_user[:id], logged_in: true)
    @current_workspace ||= Workspace.find_by_id(connection[:workspace_id])
---
SELECT  "workspace_users".* FROM "workspace_users" WHERE "workspace_users"."user_id" = $1 AND "workspace_users"."logged_in" = $2 LIMIT $3  [["user_id", 1], ["logged_in", true], ["LIMIT", 1]]
SELECT  "workspaces".* FROM "workspaces" WHERE "workspaces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]