app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "NHgfVCbcP0Z9IwSW9b2OQA"], ["updated_at", "2019-11-07 19:34:22.998601"], ["id", 1]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asdf"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = User.find_by_email(email)