app/models/workspace_user.rb

  def login!
    self.logged_in = true;
    self.save
---
UPDATE "workspace_users" SET "logged_in" = $1, "updated_at" = $2 WHERE "workspace_users"."id" = $3  [["logged_in", true], ["updated_at", "2019-11-05 01:32:45.704271"], ["id", 1]]

  def logout!
    self.logged_in = false;
    self.save
---
UPDATE "workspace_users" SET "logged_in" = $1, "updated_at" = $2 WHERE "workspace_users"."id" = $3  [["logged_in", false], ["updated_at", "2019-11-05 01:59:53.421452"], ["id", 1]]